In [9]:
#Assignment - 2
#Importing the necessary libraries
import pandas as pd
import numpy as np
#Importing the dataset

In [10]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

users = pd.read_csv(url, sep= "|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [11]:
users = users.set_index('user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [12]:
#First 10 and Last 10 entries
print('--------First 10 entries -------')
users.head(10)

--------First 10 entries -------

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [13]:
print('--------Last 10 entries -------')
users.tail(10)

--------Last 10 entries -------

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [14]:
#Number of observations in the dataset
users.count()

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

In [15]:
#number of columns in the dataset
print('Number of columns :', users.shape[1])

Number of columns : 4

In [16]:
#Printing the name of all the columns.
print('Name of all the columns:',(users.columns))

Name of all the columns: Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [17]:
#checking the data type of each column
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [18]:
#Printing only the occupation column
print(users['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [22]:
#counting different occupations in this dataset
users['occupation'].nunique()

21

In [21]:
users['occupation'].count()

943

In [23]:
#What is the most frequent occupation
df = pd.DataFrame(users)
df['occupation'].value_counts(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

In [24]:
#DataFrame Info.
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [25]:
#Summarize only the occupation column has done already.
users['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [26]:
#Calculating mean age of users
users['age'].mean()

34.05196182396607

In [27]:

#What is the age with least occurrence
users['age'].min()

7